leocafonso/nuttx/arch/arm/src/ra4m1/hardware/ra4m1_sci.h
/* No registers defined for peripheral SCI1. Using those of SCI0. */
#define R_SCI1_SMR_OFFSET                 R_SCI0_SMR_OFFSET
#define R_SCI1_SMR                        R_SCI0_SMR
#define R_SCI1_SMR_CM                     R_SCI0_SMR_CM
#define R_SCI1_SMR_CHR                    R_SCI0_SMR_CHR
#define R_SCI1_SMR_PE                     R_SCI0_SMR_PE
#define R_SCI1_SMR_PM                     R_SCI0_SMR_PM
#define R_SCI1_SMR_STOP                   R_SCI0_SMR_STOP
#define R_SCI1_SMR_MP                     R_SCI0_SMR_MP
#define R_SCI1_SMR_CKS                    R_SCI0_SMR_CKS
#define R_SCI1_SMR_CKS_MASK               R_SCI0_SMR_CKS_MASK
#define R_SCI1_SMR_SMCI_OFFSET            R_SCI0_SMR_SMCI_OFFSET
#define R_SCI1_SMR_SMCI                   R_SCI0_SMR_SMCI
#define R_SCI1_SMR_SMCI_GM                R_SCI0_SMR_SMCI_GM
#define R_SCI1_SMR_SMCI_BLK               R_SCI0_SMR_SMCI_BLK
#define R_SCI1_SMR_SMCI_PE                R_SCI0_SMR_SMCI_PE
#define R_SCI1_SMR_SMCI_PM                R_SCI0_SMR_SMCI_PM
#define R_SCI1_SMR_SMCI_BCP               R_SCI0_SMR_SMCI_BCP
#define R_SCI1_SMR_SMCI_BCP_MASK          R_SCI0_SMR_SMCI_BCP_MASK
#define R_SCI1_SMR_SMCI_CKS               R_SCI0_SMR_SMCI_CKS
#define R_SCI1_SMR_SMCI_CKS_MASK          R_SCI0_SMR_SMCI_CKS_MASK
#define R_SCI1_BRR_OFFSET                 R_SCI0_BRR_OFFSET
#define R_SCI1_BRR                        R_SCI0_BRR
#define R_SCI1_BRR_BRR                    R_SCI0_BRR_BRR
#define R_SCI1_BRR_BRR_MASK               R_SCI0_BRR_BRR_MASK
#define R_SCI1_SCR_OFFSET                 R_SCI0_SCR_OFFSET
#define R_SCI1_SCR                        R_SCI0_SCR
#define R_SCI1_SCR_TIE                    R_SCI0_SCR_TIE
#define R_SCI1_SCR_RIE                    R_SCI0_SCR_RIE
#define R_SCI1_SCR_TE                     R_SCI0_SCR_TE
#define R_SCI1_SCR_RE                     R_SCI0_SCR_RE
#define R_SCI1_SCR_MPIE                   R_SCI0_SCR_MPIE
#define R_SCI1_SCR_TEIE                   R_SCI0_SCR_TEIE
#define R_SCI1_SCR_CKE                    R_SCI0_SCR_CKE
#define R_SCI1_SCR_CKE_MASK               R_SCI0_SCR_CKE_MASK
#define R_SCI1_SCR_SMCI_OFFSET            R_SCI0_SCR_SMCI_OFFSET
#define R_SCI1_SCR_SMCI                   R_SCI0_SCR_SMCI
#define R_SCI1_SCR_SMCI_TIE               R_SCI0_SCR_SMCI_TIE
#define R_SCI1_SCR_SMCI_RIE               R_SCI0_SCR_SMCI_RIE
#define R_SCI1_SCR_SMCI_TE                R_SCI0_SCR_SMCI_TE
#define R_SCI1_SCR_SMCI_RE                R_SCI0_SCR_SMCI_RE
#define R_SCI1_SCR_SMCI_MPIE              R_SCI0_SCR_SMCI_MPIE
#define R_SCI1_SCR_SMCI_TEIE              R_SCI0_SCR_SMCI_TEIE
#define R_SCI1_SCR_SMCI_CKE               R_SCI0_SCR_SMCI_CKE
#define R_SCI1_SCR_SMCI_CKE_MASK          R_SCI0_SCR_SMCI_CKE_MASK
#define R_SCI1_TDR_OFFSET                 R_SCI0_TDR_OFFSET
#define R_SCI1_TDR                        R_SCI0_TDR
#define R_SCI1_TDR_TDR                    R_SCI0_TDR_TDR
#define R_SCI1_TDR_TDR_MASK               R_SCI0_TDR_TDR_MASK
#define R_SCI1_SSR_OFFSET                 R_SCI0_SSR_OFFSET
#define R_SCI1_SSR                        R_SCI0_SSR
#define R_SCI1_SSR_TDRE                   R_SCI0_SSR_TDRE
#define R_SCI1_SSR_RDRF                   R_SCI0_SSR_RDRF
#define R_SCI1_SSR_ORER                   R_SCI0_SSR_ORER
#define R_SCI1_SSR_FER                    R_SCI0_SSR_FER
#define R_SCI1_SSR_PER                    R_SCI0_SSR_PER
#define R_SCI1_SSR_TEND                   R_SCI0_SSR_TEND
#define R_SCI1_SSR_MPB                    R_SCI0_SSR_MPB
#define R_SCI1_SSR_MPBT                   R_SCI0_SSR_MPBT
#define R_SCI1_SSR_FIFO_OFFSET            R_SCI0_SSR_FIFO_OFFSET
#define R_SCI1_SSR_FIFO                   R_SCI0_SSR_FIFO
#define R_SCI1_SSR_FIFO_TDFE              R_SCI0_SSR_FIFO_TDFE
#define R_SCI1_SSR_FIFO_RDF               R_SCI0_SSR_FIFO_RDF
#define R_SCI1_SSR_FIFO_ORER              R_SCI0_SSR_FIFO_ORER
#define R_SCI1_SSR_FIFO_FER               R_SCI0_SSR_FIFO_FER
#define R_SCI1_SSR_FIFO_PER               R_SCI0_SSR_FIFO_PER
#define R_SCI1_SSR_FIFO_TEND              R_SCI0_SSR_FIFO_TEND
#define R_SCI1_SSR_FIFO_DR                R_SCI0_SSR_FIFO_DR
#define R_SCI1_SSR_SMCI_OFFSET            R_SCI0_SSR_SMCI_OFFSET
#define R_SCI1_SSR_SMCI                   R_SCI0_SSR_SMCI
#define R_SCI1_SSR_SMCI_TDRE              R_SCI0_SSR_SMCI_TDRE
#define R_SCI1_SSR_SMCI_RDRF              R_SCI0_SSR_SMCI_RDRF
#define R_SCI1_SSR_SMCI_ORER              R_SCI0_SSR_SMCI_ORER
#define R_SCI1_SSR_SMCI_ERS               R_SCI0_SSR_SMCI_ERS
#define R_SCI1_SSR_SMCI_PER               R_SCI0_SSR_SMCI_PER
#define R_SCI1_SSR_SMCI_TEND              R_SCI0_SSR_SMCI_TEND
#define R_SCI1_SSR_SMCI_MPB               R_SCI0_SSR_SMCI_MPB
#define R_SCI1_SSR_SMCI_MPBT              R_SCI0_SSR_SMCI_MPBT
#define R_SCI1_RDR_OFFSET                 R_SCI0_RDR_OFFSET
#define R_SCI1_RDR                        R_SCI0_RDR
#define R_SCI1_RDR_RDR                    R_SCI0_RDR_RDR
#define R_SCI1_RDR_RDR_MASK               R_SCI0_RDR_RDR_MASK
#define R_SCI1_SCMR_OFFSET                R_SCI0_SCMR_OFFSET
#define R_SCI1_SCMR                       R_SCI0_SCMR
#define R_SCI1_SCMR_BCP2                  R_SCI0_SCMR_BCP2
#define R_SCI1_SCMR_CHR1                  R_SCI0_SCMR_CHR1
#define R_SCI1_SCMR_SDIR                  R_SCI0_SCMR_SDIR
#define R_SCI1_SCMR_SINV                  R_SCI0_SCMR_SINV
#define R_SCI1_SCMR_SMIF                  R_SCI0_SCMR_SMIF
#define R_SCI1_SEMR_OFFSET                R_SCI0_SEMR_OFFSET
#define R_SCI1_SEMR                       R_SCI0_SEMR
#define R_SCI1_SEMR_RXDESEL               R_SCI0_SEMR_RXDESEL
#define R_SCI1_SEMR_BGDM                  R_SCI0_SEMR_BGDM
#define R_SCI1_SEMR_NFEN                  R_SCI0_SEMR_NFEN
#define R_SCI1_SEMR_ABCS                  R_SCI0_SEMR_ABCS
#define R_SCI1_SEMR_ABCSE                 R_SCI0_SEMR_ABCSE
#define R_SCI1_SEMR_BRME                  R_SCI0_SEMR_BRME
#define R_SCI1_SNFR_OFFSET                R_SCI0_SNFR_OFFSET
#define R_SCI1_SNFR                       R_SCI0_SNFR
#define R_SCI1_SNFR_NFCS                  R_SCI0_SNFR_NFCS
#define R_SCI1_SNFR_NFCS_MASK             R_SCI0_SNFR_NFCS_MASK
#define R_SCI1_SIMR1_OFFSET               R_SCI0_SIMR1_OFFSET
#define R_SCI1_SIMR1                      R_SCI0_SIMR1
#define R_SCI1_SIMR1_IICDL                R_SCI0_SIMR1_IICDL
#define R_SCI1_SIMR1_IICDL_MASK           R_SCI0_SIMR1_IICDL_MASK
#define R_SCI1_SIMR1_IICM                 R_SCI0_SIMR1_IICM
#define R_SCI1_SIMR2_OFFSET               R_SCI0_SIMR2_OFFSET
#define R_SCI1_SIMR2                      R_SCI0_SIMR2
#define R_SCI1_SIMR2_IICACKT              R_SCI0_SIMR2_IICACKT
#define R_SCI1_SIMR2_IICCSC               R_SCI0_SIMR2_IICCSC
#define R_SCI1_SIMR2_IICINTM              R_SCI0_SIMR2_IICINTM
#define R_SCI1_SIMR3_OFFSET               R_SCI0_SIMR3_OFFSET
#define R_SCI1_SIMR3                      R_SCI0_SIMR3
#define R_SCI1_SIMR3_IICSCLS              R_SCI0_SIMR3_IICSCLS
#define R_SCI1_SIMR3_IICSCLS_MASK         R_SCI0_SIMR3_IICSCLS_MASK
#define R_SCI1_SIMR3_IICSDAS              R_SCI0_SIMR3_IICSDAS
#define R_SCI1_SIMR3_IICSDAS_MASK         R_SCI0_SIMR3_IICSDAS_MASK
#define R_SCI1_SIMR3_IICSTIF              R_SCI0_SIMR3_IICSTIF
#define R_SCI1_SIMR3_IICSTPREQ            R_SCI0_SIMR3_IICSTPREQ
#define R_SCI1_SIMR3_IICRSTAREQ           R_SCI0_SIMR3_IICRSTAREQ
#define R_SCI1_SIMR3_IICSTAREQ            R_SCI0_SIMR3_IICSTAREQ
#define R_SCI1_SISR_OFFSET                R_SCI0_SISR_OFFSET
#define R_SCI1_SISR                       R_SCI0_SISR
#define R_SCI1_SISR_IICACKR               R_SCI0_SISR_IICACKR
#define R_SCI1_SPMR_OFFSET                R_SCI0_SPMR_OFFSET
#define R_SCI1_SPMR                       R_SCI0_SPMR
#define R_SCI1_SPMR_CKPH                  R_SCI0_SPMR_CKPH
#define R_SCI1_SPMR_CKPOL                 R_SCI0_SPMR_CKPOL
#define R_SCI1_SPMR_MFF                   R_SCI0_SPMR_MFF
#define R_SCI1_SPMR_MSS                   R_SCI0_SPMR_MSS
#define R_SCI1_SPMR_CTSE                  R_SCI0_SPMR_CTSE
#define R_SCI1_SPMR_SSE                   R_SCI0_SPMR_SSE
#define R_SCI1_TDRHL_OFFSET               R_SCI0_TDRHL_OFFSET
#define R_SCI1_TDRHL                      R_SCI0_TDRHL
#define R_SCI1_TDRHL_TDRHL                R_SCI0_TDRHL_TDRHL
#define R_SCI1_TDRHL_TDRHL_MASK           R_SCI0_TDRHL_TDRHL_MASK
#define R_SCI1_FTDRHL_OFFSET              R_SCI0_FTDRHL_OFFSET
#define R_SCI1_FTDRHL                     R_SCI0_FTDRHL
#define R_SCI1_FTDRHL_MPBT                R_SCI0_FTDRHL_MPBT
#define R_SCI1_FTDRHL_TDAT                R_SCI0_FTDRHL_TDAT
#define R_SCI1_FTDRHL_TDAT_MASK           R_SCI0_FTDRHL_TDAT_MASK
#define R_SCI1_FTDRH_OFFSET               R_SCI0_FTDRH_OFFSET
#define R_SCI1_FTDRH                      R_SCI0_FTDRH
#define R_SCI1_FTDRH_MPBT                 R_SCI0_FTDRH_MPBT
#define R_SCI1_FTDRH_TDATH                R_SCI0_FTDRH_TDATH
#define R_SCI1_FTDRL_OFFSET               R_SCI0_FTDRL_OFFSET
#define R_SCI1_FTDRL                      R_SCI0_FTDRL
#define R_SCI1_FTDRL_TDATL                R_SCI0_FTDRL_TDATL
#define R_SCI1_FTDRL_TDATL_MASK           R_SCI0_FTDRL_TDATL_MASK
#define R_SCI1_RDRHL_OFFSET               R_SCI0_RDRHL_OFFSET
#define R_SCI1_RDRHL                      R_SCI0_RDRHL
#define R_SCI1_RDRHL_RDRHL                R_SCI0_RDRHL_RDRHL
#define R_SCI1_RDRHL_RDRHL_MASK           R_SCI0_RDRHL_RDRHL_MASK
#define R_SCI1_FRDRHL_OFFSET              R_SCI0_FRDRHL_OFFSET
#define R_SCI1_FRDRHL                     R_SCI0_FRDRHL
#define R_SCI1_FRDRHL_RDF                 R_SCI0_FRDRHL_RDF
#define R_SCI1_FRDRHL_ORER                R_SCI0_FRDRHL_ORER
#define R_SCI1_FRDRHL_FER                 R_SCI0_FRDRHL_FER
#define R_SCI1_FRDRHL_PER                 R_SCI0_FRDRHL_PER
#define R_SCI1_FRDRHL_DR                  R_SCI0_FRDRHL_DR
#define R_SCI1_FRDRHL_MPB                 R_SCI0_FRDRHL_MPB
#define R_SCI1_FRDRHL_RDAT                R_SCI0_FRDRHL_RDAT
#define R_SCI1_FRDRHL_RDAT_MASK           R_SCI0_FRDRHL_RDAT_MASK
#define R_SCI1_FRDRH_OFFSET               R_SCI0_FRDRH_OFFSET
#define R_SCI1_FRDRH                      R_SCI0_FRDRH
#define R_SCI1_FRDRH_RDF                  R_SCI0_FRDRH_RDF
#define R_SCI1_FRDRH_ORER                 R_SCI0_FRDRH_ORER
#define R_SCI1_FRDRH_FER                  R_SCI0_FRDRH_FER
#define R_SCI1_FRDRH_PER                  R_SCI0_FRDRH_PER
#define R_SCI1_FRDRH_DR                   R_SCI0_FRDRH_DR
#define R_SCI1_FRDRH_MPB                  R_SCI0_FRDRH_MPB
#define R_SCI1_FRDRH_RDATH                R_SCI0_FRDRH_RDATH
#define R_SCI1_FRDRL_OFFSET               R_SCI0_FRDRL_OFFSET
#define R_SCI1_FRDRL                      R_SCI0_FRDRL
#define R_SCI1_FRDRL_RDATL                R_SCI0_FRDRL_RDATL
#define R_SCI1_FRDRL_RDATL_MASK           R_SCI0_FRDRL_RDATL_MASK
#define R_SCI1_MDDR_OFFSET                R_SCI0_MDDR_OFFSET
#define R_SCI1_MDDR                       R_SCI0_MDDR
#define R_SCI1_MDDR_MDDR                  R_SCI0_MDDR_MDDR
#define R_SCI1_MDDR_MDDR_MASK             R_SCI0_MDDR_MDDR_MASK
#define R_SCI1_DCCR_OFFSET                R_SCI0_DCCR_OFFSET
#define R_SCI1_DCCR                       R_SCI0_DCCR
#define R_SCI1_DCCR_DCME                  R_SCI0_DCCR_DCME
#define R_SCI1_DCCR_IDSEL                 R_SCI0_DCCR_IDSEL
#define R_SCI1_DCCR_DFER                  R_SCI0_DCCR_DFER
#define R_SCI1_DCCR_DPER                  R_SCI0_DCCR_DPER
#define R_SCI1_DCCR_DCMF                  R_SCI0_DCCR_DCMF
#define R_SCI1_FCR_OFFSET                 R_SCI0_FCR_OFFSET
#define R_SCI1_FCR                        R_SCI0_FCR
#define R_SCI1_FCR_RSTRG                  R_SCI0_FCR_RSTRG
#define R_SCI1_FCR_RSTRG_MASK             R_SCI0_FCR_RSTRG_MASK
#define R_SCI1_FCR_RTRG                   R_SCI0_FCR_RTRG
#define R_SCI1_FCR_RTRG_MASK              R_SCI0_FCR_RTRG_MASK
#define R_SCI1_FCR_TTRG                   R_SCI0_FCR_TTRG
#define R_SCI1_FCR_TTRG_MASK              R_SCI0_FCR_TTRG_MASK
#define R_SCI1_FCR_DRES                   R_SCI0_FCR_DRES
#define R_SCI1_FCR_TFRST                  R_SCI0_FCR_TFRST
#define R_SCI1_FCR_RFRST                  R_SCI0_FCR_RFRST
#define R_SCI1_FCR_FM                     R_SCI0_FCR_FM
#define R_SCI1_FDR_OFFSET                 R_SCI0_FDR_OFFSET
#define R_SCI1_FDR                        R_SCI0_FDR
#define R_SCI1_FDR_T                      R_SCI0_FDR_T
#define R_SCI1_FDR_T_MASK                 R_SCI0_FDR_T_MASK
#define R_SCI1_FDR_R                      R_SCI0_FDR_R
#define R_SCI1_FDR_R_MASK                 R_SCI0_FDR_R_MASK
#define R_SCI1_LSR_OFFSET                 R_SCI0_LSR_OFFSET
#define R_SCI1_LSR                        R_SCI0_LSR
#define R_SCI1_LSR_PNUM                   R_SCI0_LSR_PNUM
#define R_SCI1_LSR_PNUM_MASK              R_SCI0_LSR_PNUM_MASK
#define R_SCI1_LSR_FNUM                   R_SCI0_LSR_FNUM
#define R_SCI1_LSR_FNUM_MASK              R_SCI0_LSR_FNUM_MASK
#define R_SCI1_LSR_ORER                   R_SCI0_LSR_ORER
#define R_SCI1_CDR_OFFSET                 R_SCI0_CDR_OFFSET
#define R_SCI1_CDR                        R_SCI0_CDR
#define R_SCI1_CDR_CMPD                   R_SCI0_CDR_CMPD
#define R_SCI1_CDR_CMPD_MASK              R_SCI0_CDR_CMPD_MASK
#define R_SCI1_SPTR_OFFSET                R_SCI0_SPTR_OFFSET
#define R_SCI1_SPTR                       R_SCI0_SPTR
#define R_SCI1_SPTR_SPB2IO                R_SCI0_SPTR_SPB2IO
#define R_SCI1_SPTR_SPB2DT                R_SCI0_SPTR_SPB2DT
#define R_SCI1_SPTR_RXDMON                R_SCI0_SPTR_RXDMON

